{"posts":[{"title":"Hello everyone!","text":"I am a postgraduate computer science majored student studying in Nanjing, China. My interested research field is computer graphics, including rendering and simulation, since I am really facinated by the beautiful scenery that could be produced by imaging algorithms. Here are some projects related to rendering and display I have done before. Play around with ShaderToyThis one only uses the indirect lighting (the fancy MIS or NEE is not included) This one is for learning the Multiple importance sampling (the result is biased), put it here anyway… Here is a Shader that I created to implement Disney BRDF (tbh, the result seems not entirely correct…) And the last one, this one is where I finally got MIS into my path tracer with the help from NVIDIA GPU GEMS book. Because the compile time of the second and last one takes a bit longer, ShaderToy only shows a preview picture of it, if you want to see it in real time, you can checkout here! Play around with OpenGL Compute ShaderSince I got a lot of job (yeah, including the hardest part) done, I want to extend the shader I’ve created into a working rendering engine. I did some research on OpenGL compute shader (why OpenGL, cuz I love OpenGL and familiar with it and I did my bachelor thesis on it, btw, OpenGL is simple to use), and port my ShaderToy Shader to it. Also, there is much more care needs to be taken other than rendering itself, for example, camera system, mesh I/O, material system, sampling system, data transport between CPU and GPU, etc. So, yeah, the overall routine takes about half a month to complete without any code refactoring (I mean seriously, it needs to be refactored). Here are some of the ScreenShots: For real, the code needs to be refactored for further optimization and extension (the microfacet brdf model has not yet been integrated into it). If I have time, I will take it seriously (especially for the accelerator).","link":"/2023/09/23/hello-world/"}],"tags":[],"categories":[],"pages":[]}