{"posts":[{"title":"Hello everyone!","text":"Here are some projects related to rendering and display I have done before. If you would like to know more about me, please visit the About page. Code pieces on ShaderToyThis one only uses the indirect lighting (the fancy MIS or NEE is not included) This one is for learning the Multiple importance sampling (the result is biased), put it here anyway… Here is a Shader that I created to implement Disney BRDF (tbh, the result seems not entirely correct…) And the last one, this one is where I finally got MIS into my path tracer with the help from NVIDIA GPU GEMS book. Because the compile time of the second and last one takes a bit longer, ShaderToy only shows a preview picture of it. The real-time versions are here! (Although I don’t want to admit it, it actually bugged on AMD cards) OpenGL Compute Shader based path tracerSince I got a lot of jobs (yeah, including the hardest part) done, I want to extend the shader I’ve created into a working rendering engine. I did some research on OpenGL compute shader (why OpenGL, cuz I am familiar with it and OpenGL is a great tool for visualization), and port my ShaderToy Shader to it. Also, there is much more care that needs to be taken other than rendering itself, for example, camera system, mesh I/O, material system, sampling system, data transport between CPU and GPU, etc. So, yeah, the overall routine takes about half a month to complete without code refactoring. Here are some of the ScreenShots: The code needs to be refactored for further optimization and extension (the microfacet brdf model has not yet been integrated into it).","link":"/2023/09/23/hello-world/"}],"tags":[],"categories":[],"pages":[{"title":"About","text":"I am a postgraduate computer science majored student studying in Nanjing, China. My interested research field is computer graphics, including rendering, simulation and VR/AR techniques, since I am really facinated by the beautiful scenery that could be produced by imaging algorithms. EducationAdvanced educationNanjing Tech University (2021 - present)Nanjing University of Information Science &amp; Technology (2017 - 2021) Basic educationJiangsu Jiangyan No.2 High School (2014 - 2017)Jiangyan Nan Yuan School (2011 - 2014)Dongqiao Elementary School (2005 - 2011) Publications &amp; Projects (Recent)Project: OpenGL compute shader path tracer (2023)Project: Material experiments on Shadertoy (2022)Project: A real-time ARAP mesh deformation using the least squares DSL Opt optimization (2022)Project: An Editor for competative programming with in-editor support of server compilation and local compilation. (2021)Project: HUAWEI mindspore opetrator design (2021).Software certificate: Illumengine-a 3D rendering system with PBR support (2021)Project (excellent bachelor thesis): An OpenGL based 3D rendering system (2020 - 2021) SkillsC/C++ (most frequently used), Python, Matlab, Javascript, Java, UE5 (game engine). Hobbiescalligraphy, violin, anime, jogging and video games.","link":"/about/index.html"}]}